Logistics_FTP_App/VS_PNA_request.xml

<?xml version = "1.0" encoding = "UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header>
    <ns:PartyInfo xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:soap-enc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns0="http://www.tibco.com/namespaces/bc/2002/04/partyinfo.xsd" xmlns:ns="http://www.tibco.com/namespaces/bc/2002/04/partyinfo.xsd">
      <from>
        <name>redacted</name>
      </from>
      <to>
        <name>Ingram Micro</name>
      </to>
      <operationID>Price And Availability/3.0/Price And Availability Query</operationID>
      <operationType>sync</operationType>
      <transactionID>20050616000001</transactionID>
    </ns:PartyInfo>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <ns0:OperationRequest xmlns:ns0="http://pnarequest.org/body">
      <ns0:OpHeader>
        <ns0:userID>visuser1</ns0:userID>
        <ns0:userPassword>VisIM52705</ns0:userPassword>
      </ns0:OpHeader>
      <ns0:PNARequest>
        <ns0:ProductLineItem>
          <ns0:SKU>F91380</ns0:SKU>
        </ns0:ProductLineItem>
        <ns0:priceAndAvailabilityOption>Pricing and Availability</ns0:priceAndAvailabilityOption>
      </ns0:PNARequest>
    </ns0:OperationRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
